NordicPlayground/nrf52-hardware-startup-hands-on/hardware_startup_solution.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
/*
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}
*/

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/* ##### HANDS ON CODE START ###### */

/* ### ADD ACCELEROMETER TIMEOUT HANDLER HERE ### */
static void acc_timer_handler(void * p_context)
{
        uint32_t err_code;
        int8_t x,y,z = 0;
    
        MMA7660_read_acc_data(&x,&y,&z);

        uint8_t data[20];
        sprintf(data, "ACC: X:%i Y:%i Z:%i \r\n", x,y,z);
   
        err_code = ble_nus_string_send(&m_nus, data, sizeof(data));
        APP_ERROR_CHECK(err_code);
}

/* ### ADD ADC TIMEOUT HANDLER HERE ### */
static void adc_timer_handler(void * p_context)
{
    uint32_t err_code;
    
    err_code = nrf_drv_saadc_sample();
    
    APP_ERROR_CHECK(err_code);
}

void init_timers()
{  
    /* ### ADD ADC TIMER CODE HERE ### */
    uint32_t err_code;
    
    err_code = app_timer_create(&m_acc_timer_id, 
                                    APP_TIMER_MODE_REPEATED,
                                    acc_timer_handler);
    APP_ERROR_CHECK(err_code);
    
    /* ### END ADC TIMER CODE ### */
    
    /* ### ADD ACCELEROMETER TIMER CODE HERE ### */
    err_code = app_timer_create(&m_adc_timer_id, 
                                    APP_TIMER_MODE_REPEATED,
                                    adc_timer_handler);
    APP_ERROR_CHECK(err_code);
    
    /* ### END ACCELEROMETER TIMER CODE ### */
    
}


void pwm_ready_callback(uint32_t pwm_id)    // PWM callback function
{
    ready_flag = true;
}

void pwm_init()
{
    uint32_t err_code;
     /* 2-channel PWM, 200Hz, output on DK LED pins. */
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_2CH(5000L, 16, 19);
    app_pwm_config_t pwm2_cfg = APP_PWM_DEFAULT_CONFIG_1CH(5000L, 20);


    /* Switch the polarity of the second channel. */
    pwm1_cfg.pin_polarity[0] = APP_PWM_POLARITY_ACTIVE_LOW;
    pwm1_cfg.pin_polarity[1] = APP_PWM_POLARITY_ACTIVE_LOW;
    
    /* Initialize PWM1. */
    err_code = app_pwm_init(&PWM1,&pwm1_cfg,pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    
    /* Initialize PWM2. */
    err_code = app_pwm_init(&PWM2,&pwm2_cfg,pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    
    /* Enable PWM1 and PWM2 */
    app_pwm_enable(&PWM1);
    app_pwm_enable(&PWM2);
}

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;
     
        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
        
        int i;
        printf("ADC event number: %d\r\n",(int)m_adc_evt_counter);
        for (i = 0; i < SAMPLES_IN_BUFFER; i++)
        {
            printf("%i\r\n", (int)p_event->data.done.p_buffer[i]);
        }
        m_adc_evt_counter++;
      
        /* ### TASK 2 CODE HERE ### */
      
        uint8_t data[20];
        sprintf(data, "ADC Value: %i", (int)p_event->data.done.p_buffer[0]);
   
        err_code = ble_nus_string_send(&m_nus, data, sizeof(data));
        APP_ERROR_CHECK(err_code);
        
        /* ### TASK 2 CODE ### */
    }
}

void saadc_init(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config =
            NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);
    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0],SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1],SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
}

void rgb_led_set(int color)
{
    if(color == RED)
    {
         while (app_pwm_channel_duty_set(&PWM1, 0, 50) == NRF_ERROR_BUSY);
    }
    else if(color == GREEN)
    {
         while (app_pwm_channel_duty_set(&PWM1, 1, 50) == NRF_ERROR_BUSY);
    }
    else if(color == BLUE)
    {
        while (app_pwm_channel_duty_set(&PWM2, 0, 50) == NRF_ERROR_BUSY);
    }    
}

void rgb_led_clear(int color)
{   
    if(color == RED)
    {
         while (app_pwm_channel_duty_set(&PWM1, 0, 0) == NRF_ERROR_BUSY);
    }
    else if(color == GREEN)
    {
         while (app_pwm_channel_duty_set(&PWM1, 1, 0) == NRF_ERROR_BUSY);
    }
    else if(color == BLUE)
    {
        while (app_pwm_channel_duty_set(&PWM2, 0, 0) == NRF_ERROR_BUSY);
    }    
}

void uart_command_handler(uart_command_t  command)
{
    uint32_t err_code = NRF_SUCCESS;
 /*   
    switch(command)
    {
        case COMMAND_1:
            // Put Action to COMMAND_1 here.
            break;
        case COMMAND_2:
            // Put Action to COMMAND_2 here.
            break;
        case COMMAND_3:
            // Put Action to COMMAND_3 here.
            break;   
        case NO_COMMAND:
        default:
            // Invalid command -> Do nothing.
            break;
    }
    */
    switch(command)
    {
        case RED_ON:
            rgb_led_set(RED);        
            break;
        case RED_OFF:
            rgb_led_clear(RED);
            break;
        case GREEN_ON:
            rgb_led_set(GREEN);
            break;
        case GREEN_OFF:
            rgb_led_clear(GREEN);
            break;
        case BLUE_ON:
            rgb_led_set(BLUE);
            break;
        case BLUE_OFF:
            rgb_led_clear(BLUE);
            break;
        case ADC_ON:
            err_code = app_timer_start(m_adc_timer_id,
                                            APP_TIMER_TICKS(1000,
                                            APP_TIMER_PRESCALER),
                                            NULL);
            break;
        case ADC_OFF:
            err_code = app_timer_stop(m_adc_timer_id);
            break;
        case ACC_ON:
            err_code = app_timer_start(m_acc_timer_id,
                                        APP_TIMER_TICKS(1000,
                                        APP_TIMER_PRESCALER),
                                        NULL);
            break;
        case ACC_OFF:
            err_code = app_timer_stop(m_acc_timer_id);
            break;
        case NO_COMMAND:
        default:
            break;
    }
    /* Reset the command variable to NO_COMMAND */
    command = NO_COMMAND;
    
    APP_ERROR_CHECK(err_code);
    
}

/* ##### HANDS ON CODE END ###### */

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
   
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    printf("\r\nUART Start!\r\n");

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    
    /* #### PLACE TASK 1 CODE HERE #### */  
    
    /* Initialize the PWM driver */                            
    pwm_init();
    
        
    /* #### PLACE TASK 2 CODE Here #### */  
    
    /* Initialize the application timer */
    init_timers();
    
    /* Inititalize the Single Approximation ADC(SAADC) */
    saadc_init();
    
    
    /* #### PLACE TASK 3 CODE HERE #### */
    
    /* Initilize the TWI driver */
    twi_master_init();

    /* Set the MMA7660 in Active Mode */
    MMA7660_set_mode();
       
    // Enter main loop.
    for (;;)
    {
        /* Handler that executes the commands sent over the Nordic UART Service */
        uart_command_handler(command);

        /* Put the nRF52 DK to sleep when there are no interrupts */
        power_manage();
    }    
}
    /* ### END MOD ### */   

/** 
 * @}
 */
